Tekla Open API Reference for Tekla Structures 2025
ArrowheadAttributes Constructor (ArrowheadPositions, ArrowheadTypes, Double, Double)
 Creates a new arrowhead attributes instance with the given parameters.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrowheadAttributes(
	ArrowheadPositions arrowPosition,
	ArrowheadTypes head,
	double height,
	double width
)
Public Sub New (
	arrowPosition As ArrowheadPositions,
	head As ArrowheadTypes,
	height As Double,
	width As Double
)
Parameters
arrowPosition
Type: Tekla.Structures.Drawing.ArrowheadPositions
The arrowhead position.
head
Type: Tekla.Structures.Drawing.ArrowheadTypes
The arrowhead type.
height
Type: System.Double
The arrowhead height.
width
Type: System.Double
The arrowhead width.
See Also
Reference
ArrowheadAttributes Class
ArrowheadAttributes Overload
Tekla.Structures.Drawing Namespace